dastin-alex/esp8266_test/src/main.cpp
#include "esp8266_test.h"

void setup()

{

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                       ОДНОКРАТНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // вывод в UART значения времени                                               timescan
  // включение UART, модуля WiFi. подключение к сети по UDP
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА TS00
  // включение, настройка UART
  // начало печати отчёта
  // ----------------------------------------------------------------------------

  Serial.begin(9600);          // МЕТОД Serial.begin : скорость 9600 бод
  Serial.println();            // МЕТОД Serial.println
  Serial.println();            // МЕТОД Serial.println
  Serial.print("connect to "); // МЕТОД Serial.print
  Serial.println(ssid);        // МЕТОД Serial.println : значение SSID

  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА TS01
  // включение модуля WIFI. режим station mode.
  // регистрация в сети WIFI
  // ----------------------------------------------------------------------------

  WiFi.mode(WIFI_STA);    // МЕТОД WiFi.mode  : режим station mode
  WiFi.begin(ssid, pass); // МЕТОД WiFi.begin : регистрация в сети WIFI

  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА TS02
  // цикл опроса состояния соединения.
  // ПОКА состояние соединения != WL_CONNECTED: ТО пауза ожидания 500
  // ----------------------------------------------------------------------------

  while (WiFi.status() != WL_CONNECTED) // WiFi.status : состояние соединения

  {

    // ---------------------------------------------------------------------- delay 500
    //                                                                       ЗАДАЧА TS03
    // пауза ожидания 50 мсек
    // ----------------------------------------------------------------------------

    delay(500);

    // -- static uint32_t tmr_ts03;     // программный таймер задачи TS03
    // -- static bool flag_ts03 = true; // программный флаг. разрешение задачи TS03
    // --
    // --     if (flag_ts03 && (millis() - tmr_ts03 >= 500))
    // --
    // --     {
    // --       tmr_ts03 = millis();
    // --       flag_ts03 = false;
    // --     }

    Serial.print("."); // МЕТОД Serial.print
  }

  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА TS04
  // начало сеанса работы по протоколу UDP
  // ----------------------------------------------------------------------------

  udp.begin(localPort); // МЕТОД udp.begin

  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА TS05
  // печать в UART отчёта.
  // информация о подключении к сети WIFI
  // информация о настройке протокола UDP
  // ----------------------------------------------------------------------------

  Serial.println("");               // МЕТОД Serial.println
  Serial.println("WIFI connected"); // МЕТОД Serial.println
  Serial.print("IP address: ");     // МЕТОД Serial.print
  Serial.println(WiFi.localIP());   // МЕТОД Serial.println, WiFi.localIP
  Serial.print("Local port: ");     // МЕТОД Serial.print
  Serial.println(udp.localPort());  // МЕТОД Serial.println, udp.localPort
  Serial.println("");               // МЕТОД Serial.println

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                       ОДНОКРАТНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // непрерывная световая сигнализация                                              blink
  // начальная настройка контакта встроенного светодиода LED_BUILTIN
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  pinMode(LED_BUILTIN, OUTPUT); // светодиод. режим OUTPUT

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                       ОДНОКРАТНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // контроль нажатия встроенной кнопки FLASH                                    keypress
  // начальная настройка контакта 15  (IO0, GPIO0, SPICS2)
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  pinMode(15, INPUT_PULLUP); // кнопка. режим INPUT_PULLUP
}

void loop()

{

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // периодический вывод в UART значения времени,                                timescan
  // полученного от сервера времени NTP
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА TS06
  // подключение к сети WIFI.
  // случайный выбор сервера NTP из пула
  // ----------------------------------------------------------------------------

  WiFi.hostByName(ntpServerName, timeServerIP); // МЕТОД WiFi.hostByName

  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА TS07
  // начальная установка битовых полей пакета запроса времени NTP.
  // установка всех байтов буфера пакета в 0.
  // установка необходимых байтов буфера пакета.
  // байты 4 .. 11 (8 байтов) соответствуют полям Root Delay и Root Dispersion
  // ----------------------------------------------------------------------------

  memset(packetBuffer, 0, NTP_PACKET_SIZE);

  packetBuffer[0] = 0b11100011; // LI, версия, режим
  packetBuffer[1] = 0;          // уровень или тип часов
  packetBuffer[2] = 6;          // интервал
  packetBuffer[3] = 0xEC;       // точность (Peer Clock Precision)

  packetBuffer[12] = 49;
  packetBuffer[13] = 0x4E;
  packetBuffer[14] = 49;
  packetBuffer[15] = 52;

  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА TS08
  // пакет запроса времени NTP сформирован.
  // отправка пакета NTP в выбранный сервер времени.
  // передача пакета в порт 123.
  // ----------------------------------------------------------------------------

  udp.beginPacket(timeServerIP, 123);       // МЕТОД udp.beginPacket
  udp.write(packetBuffer, NTP_PACKET_SIZE); // МЕТОД udp.write
  udp.endPacket();                          // МЕТОД udp.endPacket

